tutorials/7.1.4.1D_2phase_2componentGas_YCO2i_0_compositionalDarcyFoam_mutual_slbty_U_0.5_den_mu/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

cp 0.orig 0 -R

runApplication blockMesh

runApplication $(getApplication)

#------------------------------------------------------------------------------